# DataFrame

In [2]:
import pandas as pd
import numpy  as np

In [3]:
data = {"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
       
        "score":[90,80,85,75,95,60,65],  
        
       "sport":["Wrestling","Football","Skiing","Swimming",
                "Tennis","Karete","Surfing"],      
       
        "sex":["M","M","M","M","F","F","F"]}

In [4]:
data

{'name': ['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'],
 'score': [90, 80, 85, 75, 95, 60, 65],
 'sport': ['Wrestling',
  'Football',
  'Skiing',
  'Swimming',
  'Tennis',
  'Karete',
  'Surfing'],
 'sex': ['M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [5]:
data.keys()

dict_keys(['name', 'score', 'sport', 'sex'])

In [6]:
data.values()

dict_values([['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'], [90, 80, 85, 75, 95, 60, 65], ['Wrestling', 'Football', 'Skiing', 'Swimming', 'Tennis', 'Karete', 'Surfing'], ['M', 'M', 'M', 'M', 'F', 'F', 'F']])

In [7]:
type(data)

dict

In [8]:
df=pd.DataFrame(data)

In [9]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [10]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.head(2)
# () by default : 1st 5 rows!

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M

In [14]:
df.tail(2)
# () by default : last 5 rows!

      name  score    sport sex
5  Vanessa     60   Karete   F
6     Kate     65  Surfing   F

In [16]:
df.shape
# rows,columns

(7, 4)

In [17]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [18]:
df['name']

0       Bill
1        Tom
2        Tim
3       John
4       Alex
5    Vanessa
6       Kate
Name: name, dtype: object

In [19]:
type(df['name'])

pandas.core.series.Series

In [20]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [21]:
df[['name','sport','score']]

      name      sport  score
0     Bill  Wrestling     90
1      Tom   Football     80
2      Tim     Skiing     85
3     John   Swimming     75
4     Alex     Tennis     95
5  Vanessa     Karete     60
6     Kate    Surfing     65

In [22]:
data

{'name': ['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'],
 'score': [90, 80, 85, 75, 95, 60, 65],
 'sport': ['Wrestling',
  'Football',
  'Skiing',
  'Swimming',
  'Tennis',
  'Karete',
  'Surfing'],
 'sex': ['M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [23]:
data.keys()

dict_keys(['name', 'score', 'sport', 'sex'])

In [24]:
df=pd.DataFrame(data,columns=["name", "sport", "score",
                              "sex","age"],
                
                index=["one","two","three","four","five",
                       "six","seven"])

In [25]:
df.head()

       name      sport  score sex  age
one    Bill  Wrestling     90   M  NaN
two     Tom   Football     80   M  NaN
three   Tim     Skiing     85   M  NaN
four   John   Swimming     75   M  NaN
five   Alex     Tennis     95   F  NaN

In [26]:
df.isnull().sum()

name     0
sport    0
score    0
sex      0
age      7
dtype: int64

In [27]:
df

          name      sport  score sex  age
one       Bill  Wrestling     90   M  NaN
two        Tom   Football     80   M  NaN
three      Tim     Skiing     85   M  NaN
four      John   Swimming     75   M  NaN
five      Alex     Tennis     95   F  NaN
six    Vanessa     Karete     60   F  NaN
seven     Kate    Surfing     65   F  NaN

In [28]:
df.drop('age',axis = 1)

          name      sport  score sex
one       Bill  Wrestling     90   M
two        Tom   Football     80   M
three      Tim     Skiing     85   M
four      John   Swimming     75   M
five      Alex     Tennis     95   F
six    Vanessa     Karete     60   F
seven     Kate    Surfing     65   F

In [31]:
# df = df.drop('age',axis = 1)
df.drop('age',axis = 1,inplace=True)

In [32]:
df

          name      sport  score sex
one       Bill  Wrestling     90   M
two        Tom   Football     80   M
three      Tim     Skiing     85   M
four      John   Swimming     75   M
five      Alex     Tennis     95   F
six    Vanessa     Karete     60   F
seven     Kate    Surfing     65   F

In [34]:
df2=df

In [35]:
df2.head()

       name      sport  score sex
one    Bill  Wrestling     90   M
two     Tom   Football     80   M
three   Tim     Skiing     85   M
four   John   Swimming     75   M
five   Alex     Tennis     95   F

In [36]:
df2.reset_index()
# default index - new
# old index became a new col!

   index     name      sport  score sex
0    one     Bill  Wrestling     90   M
1    two      Tom   Football     80   M
2  three      Tim     Skiing     85   M
3   four     John   Swimming     75   M
4   five     Alex     Tennis     95   F
5    six  Vanessa     Karete     60   F
6  seven     Kate    Surfing     65   F

In [37]:
df2.reset_index(drop=True)
# old index gets dropped
# new index

      name      sport  score sex
0     Bill  Wrestling     90   M
1      Tom   Football     80   M
2      Tim     Skiing     85   M
3     John   Swimming     75   M
4     Alex     Tennis     95   F
5  Vanessa     Karete     60   F
6     Kate    Surfing     65   F

In [38]:
df2.reset_index(drop=True,inplace=True)

In [39]:
df2

      name      sport  score sex
0     Bill  Wrestling     90   M
1      Tom   Football     80   M
2      Tim     Skiing     85   M
3     John   Swimming     75   M
4     Alex     Tennis     95   F
5  Vanessa     Karete     60   F
6     Kate    Surfing     65   F

In [ ]:
# df2.reset_index()
# df2.reset_index(drop=True)
# df2.reset_index(drop=True, inplace = True)
# df2 = df2.reset_index(drop=True)

In [40]:
df2

      name      sport  score sex
0     Bill  Wrestling     90   M
1      Tom   Football     80   M
2      Tim     Skiing     85   M
3     John   Swimming     75   M
4     Alex     Tennis     95   F
5  Vanessa     Karete     60   F
6     Kate    Surfing     65   F

In [44]:
df2.set_index("sport",inplace=True)

In [45]:
df2

              name  score sex
sport
Wrestling     Bill     90   M
Football       Tom     80   M
Skiing         Tim     85   M
Swimming      John     75   M
Tennis        Alex     95   F
Karete     Vanessa     60   F
Surfing       Kate     65   F